app/views/internships/_form.html.erb

    Área: <br/>
	<% for field in Field.all %>
---
SELECT `fields`.* FROM `fields`