app/views/internships/show.html.erb

  <b>Fields:</b>
	<% @internship.fields.each do |t| %>
---
SELECT * FROM `fields` INNER JOIN `fields_internships` ON `fields`.id = `fields_internships`.field_id WHERE (`fields_internships`.internship_id = 9 )