app/controllers/internships_controller.rb

  def index
    @internships = Internship.newer(params[:query]).paginate(:page => params[:page], :per_page => 10)
---
SELECT "internships".* FROM "internships" WHERE (description like '%diego' or 1=1%' OR title like '%diego' or 1=1%') ORDER BY updated_at DESC

  def list
    @internships = Internship.newer(params[:query]).paginate(:page => params[:page], :per_page => 10)
---
SELECT `internships`.* FROM `internships` WHERE (description like '%%' OR title like '%%') ORDER BY updated_at DESC

  def show
    @internship = Internship.find(params[:id])
---
SELECT `internships`.* FROM `internships` WHERE `internships`.`id` = 9 LIMIT 1

  def edit
    @internship = Internship.find(params[:id])
---
SELECT `internships`.* FROM `internships` WHERE `internships`.`id` = 1 LIMIT 1

  def create
    @internship = Internship.new(params[:internship])
    @internship.description.strip!
    @internship.owner_hash = cookies[:hash]

    fields = params[:fields].split(",")
    fields.each do |desc|
      @internship.fields << Field.new(:description => desc.strip)
---
INSERT INTO "internships" ("title", "description", "created_at", "updated_at") VALUES ('Ciro Gomes Estudio Corp', 'Aenean lacinia bibendum nulla sed consectetur. Duis mollis, est non commodo luctus, nisi erat porttitor ligula, eget lacinia odio sem nec elit. Donec id elit non mi porta gravida at eget metus. Duis mollis, est non commodo luctus, nisi erat porttitor ligula, eget lacinia odio sem nec elit. Maecenas faucibus mollis interdum. Sed posuere consectetur est at lobortis. Curabitur blandit tempus porttitor.

  def update
    params[:internship][:field_ids] ||= []
    @internship = Internship.find(params[:id])

    respond_to do |format|
      if @internship.owner_hash == cookies[:hash] and
        @internship.update_attributes(params[:internship])
---
SELECT `internships`.* FROM `internships` WHERE `internships`.`id` = 39 LIMIT 1
UPDATE "internships" SET "description" = 'Fusce dapibus, tellus ac cursus commodo, tortor mauris condimentum nibh, ut fermentum massa justo sit amet risus. Curabitur blandit tempus porttitor. Cras mattis consectetur purus sit amet fermentum. Vestibulum id ligula porta felis euismod semper. Sed posuere consectetur est at lobortis.